{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\New Desktop\Economics\ECON 860\NLSY1979\NLSY1979_B_and_H_subset.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}22 Feb 2022, 15:27:27
{txt}
{com}. import delimited "C:\New Desktop\Economics\ECON 860\NLSY1979\NLSY1979.csv"
{res}{txt}(encoding automatically selected: UTF-8)
{text}(58 vars, 12,686 obs)

{com}. 
. rename *, upper
{res}{txt}
{com}. 
. label define vlR0006500 0 "NONE"  1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YR COL"  14 "2ND YR COL"  15 "3RD YR COL"  16 "4TH YR COL"  17 "5TH YR COL"  18 "6TH YR COL"  19 "7TH YR COL"  20 "8TH YR COL OR MORE"  95 "UNGRADED" 
{txt}
{com}. label values R0006500 vlR0006500
{txt}
{com}. 
. label define vlR0007900 0 "NONE"  1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YR COL"  14 "2ND YR COL"  15 "3RD YR COL"  16 "4TH YR COL"  17 "5TH YR COL"  18 "6TH YR COL"  19 "7TH YR COL"  20 "8TH YR COL OR MORE"  95 "UNGRADED" 
{txt}
{com}. label values R0007900 vlR0007900
{txt}
{com}. 
. label define vlR0009100 0 "0"  1 "1"  2 "2"  3 "3"  4 "4"  5 "5"  6 "6"  7 "7"  8 "8"  9 "9"  10 "10"  11 "11"  12 "12"  13 "13"  14 "14"  15 "15"  16 "16 TO 99999: 16+" 
{txt}
{com}. label values R0009100 vlR0009100
{txt}
{com}. 
. label define vlR0155400 0 "0"  1 "1 TO 99"  100 "100 TO 199"  200 "200 TO 299"  300 "300 TO 399"  400 "400 TO 499"  500 "500 TO 599"  600 "600 TO 699"  700 "700 TO 799"  800 "800 TO 899"  900 "900 TO 999"  1000 "1000 TO 9999999: 1000+" 
{txt}
{com}. label values R0155400 vlR0155400
{txt}
{com}. 
. label define vlR0173600 1 "CROSS MALE WHITE"  2 "CROSS MALE WH. POOR"  3 "CROSS MALE BLACK"  4 "CROSS MALE HISPANIC"  5 "CROSS FEMALE WHITE"  6 "CROSS FEMALE WH POOR"  7 "CROSS FEMALE BLACK"  8 "CROSS FEMALE HISPANIC"  9 "SUP MALE WH POOR"  10 "SUP MALE BLACK"  11 "SUP MALE HISPANIC"  12 "SUP FEM WH POOR"  13 "SUP FEMALE BLACK"  14 "SUP FEMALE HISPANIC"  15 "MIL MALE WHITE"  16 "MIL MALE BLACK"  17 "MIL MALE HISPANIC"  18 "MIL FEMALE WHITE"  19 "MIL FEMALE BLACK"  20 "MIL FEMALE HISPANIC" 
{txt}
{com}. label values R0173600 vlR0173600
{txt}
{com}. 
. label define vlR0214700 1 "HISPANIC"  2 "BLACK"  3 "NON-BLACK, NON-HISPANIC" 
{txt}
{com}. label values R0214700 vlR0214700
{txt}
{com}. 
. label define vlR0214800 1 "MALE"  2 "FEMALE" 
{txt}
{com}. label values R0214800 vlR0214800
{txt}
{com}. 
. label define vlR0215100 0 "RURAL"  1 "URBAN" 
{txt}
{com}. label values R0215100 vlR0215100
{txt}
{com}. 
. label define vlR0216400 1 "NORTHEAST"  2 "NORTH CENTRAL"  3 "SOUTH"  4 "WEST" 
{txt}
{com}. label values R0216400 vlR0216400
{txt}
{com}. 
. label define vlR0216700 0 "NONE"  1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YR COL"  14 "2ND YR COL"  15 "3RD YR COL"  16 "4TH YR COL"  17 "5TH YR COL"  18 "6TH YR COL"  19 "7TH YR COL"  20 "8TH YR COL OR MORE"  95 "UNGRADED" 
{txt}
{com}. label values R0216700 vlR0216700
{txt}
{com}. 
. label define vlR0217502 0 "0: < 1"  1 "1"  2 "2"  3 "3"  4 "4"  5 "5"  6 "6"  7 "7"  8 "8"  9 "9"  10 "10"  11 "11"  12 "12"  13 "13"  14 "14"  15 "15"  16 "16"  17 "17 TO 99999: 17+" 
{txt}
{com}. label values R0217502 vlR0217502
{txt}
{com}. 
. label define vlR0312300 0 "0"  1 "1 TO 999"  1000 "1000 TO 1999"  2000 "2000 TO 2999"  3000 "3000 TO 3999"  4000 "4000 TO 4999"  5000 "5000 TO 5999"  6000 "6000 TO 6999"  7000 "7000 TO 7999"  8000 "8000 TO 8999"  9000 "9000 TO 9999"  10000 "10000 TO 14999"  15000 "15000 TO 19999"  20000 "20000 TO 24999"  25000 "25000 TO 49999"  50000 "50000 TO 9999999: 50000+" 
{txt}
{com}. label values R0312300 vlR0312300
{txt}
{com}. 
. label define vlR0405210 0 "0: < 1"  1 "1"  2 "2"  3 "3"  4 "4"  5 "5"  6 "6"  7 "7"  8 "8"  9 "9"  10 "10"  11 "11"  12 "12"  13 "13"  14 "14"  15 "15"  16 "16"  17 "17 TO 99999: 17+" 
{txt}
{com}. label values R0405210 vlR0405210
{txt}
{com}. 
. label define vlR0406010 0 "0"  1 "1 TO 999"  1000 "1000 TO 1999"  2000 "2000 TO 2999"  3000 "3000 TO 3999"  4000 "4000 TO 4999"  5000 "5000 TO 5999"  6000 "6000 TO 6999"  7000 "7000 TO 7999"  8000 "8000 TO 8999"  9000 "9000 TO 9999"  10000 "10000 TO 14999"  15000 "15000 TO 19999"  20000 "20000 TO 24999"  25000 "25000 TO 49999"  50000 "50000 TO 9999999: 50000+" 
{txt}
{com}. label values R0406010 vlR0406010
{txt}
{com}. 
. label define vlR0406400 0 "NONE"  1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YR COL"  14 "2ND YR COL"  15 "3RD YR COL"  16 "4TH YR COL"  17 "5TH YR COL"  18 "6TH YR COL"  19 "7TH YR COL"  20 "8TH YR COL OR MORE"  95 "UNGRADED" 
{txt}
{com}. label values R0406400 vlR0406400
{txt}
{com}. 
. label define vlR0482600 0 "0"  1 "1 TO 999"  1000 "1000 TO 1999"  2000 "2000 TO 2999"  3000 "3000 TO 3999"  4000 "4000 TO 4999"  5000 "5000 TO 5999"  6000 "6000 TO 6999"  7000 "7000 TO 7999"  8000 "8000 TO 8999"  9000 "9000 TO 9999"  10000 "10000 TO 14999"  15000 "15000 TO 19999"  20000 "20000 TO 24999"  25000 "25000 TO 49999"  50000 "50000 TO 9999999: 50000+" 
{txt}
{com}. label values R0482600 vlR0482600
{txt}
{com}. 
. label define vlR0618900 0 "NONE"  1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YR COL"  14 "2ND YR COL"  15 "3RD YR COL"  16 "4TH YR COL"  17 "5TH YR COL"  18 "6TH YR COL"  19 "7TH YR COL"  20 "8TH YR COL OR MORE"  95 "UNGRADED" 
{txt}
{com}. label values R0618900 vlR0618900
{txt}
{com}. 
. label define vlR0647103 0 "0: < 1"  1 "1"  2 "2"  3 "3"  4 "4"  5 "5"  6 "6"  7 "7"  8 "8"  9 "9"  10 "10"  11 "11"  12 "12"  13 "13"  14 "14"  15 "15"  16 "16"  17 "17 TO 99999: 17+" 
{txt}
{com}. label values R0647103 vlR0647103
{txt}
{com}. 
. label define vlR0782101 0 "0"  1 "1 TO 999"  1000 "1000 TO 1999"  2000 "2000 TO 2999"  3000 "3000 TO 3999"  4000 "4000 TO 4999"  5000 "5000 TO 5999"  6000 "6000 TO 6999"  7000 "7000 TO 7999"  8000 "8000 TO 8999"  9000 "9000 TO 9999"  10000 "10000 TO 14999"  15000 "15000 TO 19999"  20000 "20000 TO 24999"  25000 "25000 TO 49999"  50000 "50000 TO 9999999: 50000+" 
{txt}
{com}. label values R0782101 vlR0782101
{txt}
{com}. 
. label define vlR0896710 0 "0: < 1"  1 "1"  2 "2"  3 "3"  4 "4"  5 "5"  6 "6"  7 "7"  8 "8"  9 "9"  10 "10"  11 "11"  12 "12"  13 "13"  14 "14"  15 "15"  16 "16"  17 "17 TO 99999: 17+" 
{txt}
{com}. label values R0896710 vlR0896710
{txt}
{com}. 
. label define vlR0898200 0 "NONE"  1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YR COL"  14 "2ND YR COL"  15 "3RD YR COL"  16 "4TH YR COL"  17 "5TH YR COL"  18 "6TH YR COL"  19 "7TH YR COL"  20 "8TH YR COL OR MORE"  95 "UNGRADED" 
{txt}
{com}. label values R0898200 vlR0898200
{txt}
{com}. 
. label define vlR1024001 0 "0"  1 "1 TO 999"  1000 "1000 TO 1999"  2000 "2000 TO 2999"  3000 "3000 TO 3999"  4000 "4000 TO 4999"  5000 "5000 TO 5999"  6000 "6000 TO 6999"  7000 "7000 TO 7999"  8000 "8000 TO 8999"  9000 "9000 TO 9999"  10000 "10000 TO 14999"  15000 "15000 TO 19999"  20000 "20000 TO 24999"  25000 "25000 TO 49999"  50000 "50000 TO 9999999: 50000+" 
{txt}
{com}. label values R1024001 vlR1024001
{txt}
{com}. 
. label define vlR1144410 0 "0: < 1"  1 "1"  2 "2"  3 "3"  4 "4"  5 "5"  6 "6"  7 "7"  8 "8"  9 "9"  10 "10"  11 "11"  12 "12"  13 "13"  14 "14"  15 "15"  16 "16"  17 "17 TO 99999: 17+" 
{txt}
{com}. label values R1144410 vlR1144410
{txt}
{com}. 
. label define vlR1145000 0 "NONE"  1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YR COL"  14 "2ND YR COL"  15 "3RD YR COL"  16 "4TH YR COL"  17 "5TH YR COL"  18 "6TH YR COL"  19 "7TH YR COL"  20 "8TH YR COL OR MORE"  95 "UNGRADED" 
{txt}
{com}. label values R1145000 vlR1145000
{txt}
{com}. 
. label define vlR1410701 0 "0"  1 "1 TO 999"  1000 "1000 TO 1999"  2000 "2000 TO 2999"  3000 "3000 TO 3999"  4000 "4000 TO 4999"  5000 "5000 TO 5999"  6000 "6000 TO 6999"  7000 "7000 TO 7999"  8000 "8000 TO 8999"  9000 "9000 TO 9999"  10000 "10000 TO 14999"  15000 "15000 TO 19999"  20000 "20000 TO 24999"  25000 "25000 TO 49999"  50000 "50000 TO 9999999: 50000+" 
{txt}
{com}. label values R1410701 vlR1410701
{txt}
{com}. 
. label define vlR1519610 0 "0: < 1"  1 "1"  2 "2"  3 "3"  4 "4"  5 "5"  6 "6"  7 "7"  8 "8"  9 "9"  10 "10"  11 "11"  12 "12"  13 "13"  14 "14"  15 "15"  16 "16"  17 "17 TO 99999: 17+" 
{txt}
{com}. label values R1519610 vlR1519610
{txt}
{com}. 
. label define vlR1520200 0 "NONE"  1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YR COL"  14 "2ND YR COL"  15 "3RD YR COL"  16 "4TH YR COL"  17 "5TH YR COL"  18 "6TH YR COL"  19 "7TH YR COL"  20 "8TH YR COL OR MORE"  95 "UNGRADED" 
{txt}
{com}. label values R1520200 vlR1520200
{txt}
{com}. 
. label define vlR1778501 0 "0"  1 "1 TO 999"  1000 "1000 TO 1999"  2000 "2000 TO 2999"  3000 "3000 TO 3999"  4000 "4000 TO 4999"  5000 "5000 TO 5999"  6000 "6000 TO 6999"  7000 "7000 TO 7999"  8000 "8000 TO 8999"  9000 "9000 TO 9999"  10000 "10000 TO 14999"  15000 "15000 TO 19999"  20000 "20000 TO 24999"  25000 "25000 TO 49999"  50000 "50000 TO 9999999: 50000+" 
{txt}
{com}. label values R1778501 vlR1778501
{txt}
{com}. 
. label define vlR1890210 0 "0: < 1"  1 "1"  2 "2"  3 "3"  4 "4"  5 "5"  6 "6"  7 "7"  8 "8"  9 "9"  10 "10"  11 "11"  12 "12"  13 "13"  14 "14"  15 "15"  16 "16"  17 "17 TO 99999: 17+" 
{txt}
{com}. label values R1890210 vlR1890210
{txt}
{com}. 
. label define vlR1890900 0 "NONE"  1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YR COL"  14 "2ND YR COL"  15 "3RD YR COL"  16 "4TH YR COL"  17 "5TH YR COL"  18 "6TH YR COL"  19 "7TH YR COL"  20 "8TH YR COL OR MORE"  95 "UNGRADED" 
{txt}
{com}. label values R1890900 vlR1890900
{txt}
{com}. 
. label define vlR2141601 0 "0"  1 "1 TO 999"  1000 "1000 TO 1999"  2000 "2000 TO 2999"  3000 "3000 TO 3999"  4000 "4000 TO 4999"  5000 "5000 TO 5999"  6000 "6000 TO 6999"  7000 "7000 TO 7999"  8000 "8000 TO 8999"  9000 "9000 TO 9999"  10000 "10000 TO 14999"  15000 "15000 TO 19999"  20000 "20000 TO 24999"  25000 "25000 TO 49999"  50000 "50000 TO 9999999: 50000+" 
{txt}
{com}. label values R2141601 vlR2141601
{txt}
{com}. 
. label define vlR2257410 0 "0: < 1"  1 "1"  2 "2"  3 "3"  4 "4"  5 "5"  6 "6"  7 "7"  8 "8"  9 "9"  10 "10"  11 "11"  12 "12"  13 "13"  14 "14"  15 "15"  16 "16"  17 "17 TO 99999: 17+" 
{txt}
{com}. label values R2257410 vlR2257410
{txt}
{com}. 
. label define vlR2258000 0 "NONE"  1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YR COL"  14 "2ND YR COL"  15 "3RD YR COL"  16 "4TH YR COL"  17 "5TH YR COL"  18 "6TH YR COL"  19 "7TH YR COL"  20 "8TH YR COL OR MORE"  95 "UNGRADED" 
{txt}
{com}. label values R2258000 vlR2258000
{txt}
{com}. 
. label define vlR2350301 0 "0"  1 "1 TO 999"  1000 "1000 TO 1999"  2000 "2000 TO 2999"  3000 "3000 TO 3999"  4000 "4000 TO 4999"  5000 "5000 TO 5999"  6000 "6000 TO 6999"  7000 "7000 TO 7999"  8000 "8000 TO 8999"  9000 "9000 TO 9999"  10000 "10000 TO 14999"  15000 "15000 TO 19999"  20000 "20000 TO 24999"  25000 "25000 TO 49999"  50000 "50000 TO 9999999: 50000+" 
{txt}
{com}. label values R2350301 vlR2350301
{txt}
{com}. 
. label define vlR2444610 0 "0: < 1"  1 "1"  2 "2"  3 "3"  4 "4"  5 "5"  6 "6"  7 "7"  8 "8"  9 "9"  10 "10"  11 "11"  12 "12"  13 "13"  14 "14"  15 "15"  16 "16"  17 "17 TO 99999: 17+" 
{txt}
{com}. label values R2444610 vlR2444610
{txt}
{com}. 
. label define vlR2445400 0 "NONE"  1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YR COL"  14 "2ND YR COL"  15 "3RD YR COL"  16 "4TH YR COL"  17 "5TH YR COL"  18 "6TH YR COL"  19 "7TH YR COL"  20 "8TH YR COL OR MORE"  95 "UNGRADED" 
{txt}
{com}. label values R2445400 vlR2445400
{txt}
{com}. 
. label define vlR2722501 0 "0"  1 "1 TO 999"  1000 "1000 TO 1999"  2000 "2000 TO 2999"  3000 "3000 TO 3999"  4000 "4000 TO 4999"  5000 "5000 TO 5999"  6000 "6000 TO 6999"  7000 "7000 TO 7999"  8000 "8000 TO 8999"  9000 "9000 TO 9999"  10000 "10000 TO 14999"  15000 "15000 TO 19999"  20000 "20000 TO 24999"  25000 "25000 TO 49999"  50000 "50000 TO 9999999: 50000+" 
{txt}
{com}. label values R2722501 vlR2722501
{txt}
{com}. 
. label define vlR2870110 0 "0: < 1"  1 "1"  2 "2"  3 "3"  4 "4"  5 "5"  6 "6"  7 "7"  8 "8"  9 "9"  10 "10"  11 "11"  12 "12"  13 "13"  14 "14"  15 "15"  16 "16"  17 "17 TO 99999: 17+" 
{txt}
{com}. label values R2870110 vlR2870110
{txt}
{com}. 
. label define vlR2871100 0 "NONE"  1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YR COL"  14 "2ND YR COL"  15 "3RD YR COL"  16 "4TH YR COL"  17 "5TH YR COL"  18 "6TH YR COL"  19 "7TH YR COL"  20 "8TH YR COL OR MORE"  95 "UNGRADED" 
{txt}
{com}. label values R2871100 vlR2871100
{txt}
{com}. 
. label define vlR2971401 0 "0"  1 "1 TO 999"  1000 "1000 TO 1999"  2000 "2000 TO 2999"  3000 "3000 TO 3999"  4000 "4000 TO 4999"  5000 "5000 TO 5999"  6000 "6000 TO 6999"  7000 "7000 TO 7999"  8000 "8000 TO 8999"  9000 "9000 TO 9999"  10000 "10000 TO 14999"  15000 "15000 TO 19999"  20000 "20000 TO 24999"  25000 "25000 TO 49999"  50000 "50000 TO 9999999: 50000+" 
{txt}
{com}. label values R2971401 vlR2971401
{txt}
{com}. 
. label define vlR3073910 0 "0: < 1"  1 "1"  2 "2"  3 "3"  4 "4"  5 "5"  6 "6"  7 "7"  8 "8"  9 "9"  10 "10"  11 "11"  12 "12"  13 "13"  14 "14"  15 "15"  16 "16"  17 "17 TO 99999: 17+" 
{txt}
{com}. label values R3073910 vlR3073910
{txt}
{com}. 
. label define vlR3074800 0 "NONE"  1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YR COL"  14 "2ND YR COL"  15 "3RD YR COL"  16 "4TH YR COL"  17 "5TH YR COL"  18 "6TH YR COL"  19 "7TH YR COL"  20 "8TH YR COL OR MORE"  95 "UNGRADED" 
{txt}
{com}. label values R3074800 vlR3074800
{txt}
{com}. 
. label define vlR3279401 0 "0"  1 "1 TO 999"  1000 "1000 TO 1999"  2000 "2000 TO 2999"  3000 "3000 TO 3999"  4000 "4000 TO 4999"  5000 "5000 TO 5999"  6000 "6000 TO 6999"  7000 "7000 TO 7999"  8000 "8000 TO 8999"  9000 "9000 TO 9999"  10000 "10000 TO 14999"  15000 "15000 TO 19999"  20000 "20000 TO 24999"  25000 "25000 TO 49999"  50000 "50000 TO 9999999: 50000+" 
{txt}
{com}. label values R3279401 vlR3279401
{txt}
{com}. 
. label define vlR3400600 0 "0: < 1"  1 "1"  2 "2"  3 "3"  4 "4"  5 "5"  6 "6"  7 "7"  8 "8"  9 "9"  10 "10"  11 "11"  12 "12"  13 "13"  14 "14"  15 "15"  16 "16"  17 "17 TO 99999: 17+" 
{txt}
{com}. label values R3400600 vlR3400600
{txt}
{com}. 
. label define vlR3401500 0 "NONE"  1 "1ST GRADE"  2 "2ND GRADE"  3 "3RD GRADE"  4 "4TH GRADE"  5 "5TH GRADE"  6 "6TH GRADE"  7 "7TH GRADE"  8 "8TH GRADE"  9 "9TH GRADE"  10 "10TH GRADE"  11 "11TH GRADE"  12 "12TH GRADE"  13 "1ST YR COL"  14 "2ND YR COL"  15 "3RD YR COL"  16 "4TH YR COL"  17 "5TH YR COL"  18 "6TH YR COL"  19 "7TH YR COL"  20 "8TH YR COL OR MORE"  95 "UNGRADED" 
{txt}
{com}. label values R3401500 vlR3401500
{txt}
{com}. /* Crosswalk for Reference number & Question name
>  * Uncomment and edit this RENAME statement to rename variables for ease of use.
>  * This command does not guarantee uniqueness
>  */
.   /* *start* */
. 
.   rename R0000100 CASEID_1979 
{res}{txt}
{com}.   rename R0006500 HGC_MOTHER_1979   // HGC-MOTHER
{res}{txt}
{com}.   rename R0007900 HGC_FATHER_1979   // HGC-FATHER
{res}{txt}
{com}.   rename R0009100 FAM_28A_1979   // FAM-28A
{res}{txt}
{com}.   rename R0155400 Q13_5_1979   // Q13-5
{res}{txt}
{com}.   rename R0173600 SAMPLE_ID_1979 
{res}{txt}
{com}.   rename R0214700 SAMPLE_RACE_78SCRN 
{res}{txt}
{com}.   rename R0214800 SAMPLE_SEX_1979 
{res}{txt}
{com}.   rename R0215100 URBAN_RURAL_1979   // URBAN-RURAL
{res}{txt}
{com}.   rename R0216400 REGION_1979 
{res}{txt}
{com}.   rename R0216500 AGEATINT_1979 
{res}{txt}
{com}.   rename R0216700 HGC_1979 
{res}{txt}
{com}.   rename R0217502 FAMSIZE_1979 
{res}{txt}
{com}.   rename R0312300 Q13_5_1980   // Q13-5
{res}{txt}
{com}.   rename R0405210 FAMSIZE_1980 
{res}{txt}
{com}.   rename R0406010 TNFI_TRUNC_1980 
{res}{txt}
{com}.   rename R0406400 HGC_1980 
{res}{txt}
{com}.   rename R0406510 AGEATINT_1980 
{res}{txt}
{com}.   rename R0482600 Q13_5_1981   // Q13-5
{res}{txt}
{com}.   rename R0618900 HGC_1981 
{res}{txt}
{com}.   rename R0619010 AGEATINT_1981 
{res}{txt}
{com}.   rename R0647103 FAMSIZE_1981 
{res}{txt}
{com}.   rename R0782101 Q13_5_TRUNC_REVISED_1982   // Q13-5_TRUNC_REVISED
{res}{txt}
{com}.   rename R0896710 FAMSIZE_1982 
{res}{txt}
{com}.   rename R0898200 HGC_1982 
{res}{txt}
{com}.   rename R0898310 AGEATINT_1982 
{res}{txt}
{com}.   rename R1024001 Q13_5_TRUNC_REVISED_1983   // Q13-5_TRUNC_REVISED
{res}{txt}
{com}.   rename R1144410 FAMSIZE_1983 
{res}{txt}
{com}.   rename R1145000 HGC_1983 
{res}{txt}
{com}.   rename R1145110 AGEATINT_1983 
{res}{txt}
{com}.   rename R1410701 Q13_5_TRUNC_REVISED_1984   // Q13-5_TRUNC_REVISED
{res}{txt}
{com}.   rename R1519610 FAMSIZE_1984 
{res}{txt}
{com}.   rename R1520200 HGC_1984 
{res}{txt}
{com}.   rename R1520310 AGEATINT_1984 
{res}{txt}
{com}.   rename R1778501 Q13_5_TRUNC_REVISED_1985   // Q13-5_TRUNC_REVISED
{res}{txt}
{com}.   rename R1890210 FAMSIZE_1985 
{res}{txt}
{com}.   rename R1890900 HGC_1985 
{res}{txt}
{com}.   rename R1891010 AGEATINT_1985 
{res}{txt}
{com}.   rename R2141601 Q13_5_TRUNC_REVISED_1986   // Q13-5_TRUNC_REVISED
{res}{txt}
{com}.   rename R2257410 FAMSIZE_1986 
{res}{txt}
{com}.   rename R2258000 HGC_1986 
{res}{txt}
{com}.   rename R2258110 AGEATINT_1986 
{res}{txt}
{com}.   rename R2350301 Q13_5_TRUNC_REVISED_1987   // Q13-5_TRUNC_REVISED
{res}{txt}
{com}.   rename R2444610 FAMSIZE_1987 
{res}{txt}
{com}.   rename R2445400 HGC_1987 
{res}{txt}
{com}.   rename R2445510 AGEATINT_1987 
{res}{txt}
{com}.   rename R2722501 Q13_5_TRUNC_REVISED_1988   // Q13-5_TRUNC_REVISED
{res}{txt}
{com}.   rename R2870110 FAMSIZE_1988 
{res}{txt}
{com}.   rename R2871100 HGC_1988 
{res}{txt}
{com}.   rename R2871300 AGEATINT_1988 
{res}{txt}
{com}.   rename R2971401 Q13_5_TRUNC_REVISED_1989   // Q13-5_TRUNC_REVISED
{res}{txt}
{com}.   rename R3073910 FAMSIZE_1989 
{res}{txt}
{com}.   rename R3074800 HGC_1989 
{res}{txt}
{com}.   rename R3075000 AGEATINT_1989 
{res}{txt}
{com}.   rename R3279401 Q13_5_TRUNC_REVISED_1990   // Q13-5_TRUNC_REVISED
{res}{txt}
{com}.   rename R3400600 FAMSIZE_1990 
{res}{txt}
{com}.   rename R3401500 HGC_1990 
{res}{txt}
{com}.   rename R3401700 AGEATINT_1990 
{res}{txt}
{com}. 
.   drop FAMSIZE_*
{txt}
{com}.   drop if SAMPLE_RACE_78SCRN != 3 /*Drops non-white*/
{txt}(5,176 observations deleted)

{com}.   drop if SAMPLE_SEX_1979 == 2 /*Drops female*/
{txt}(3,720 observations deleted)

{com}.   drop if TNFI_TRUNC_1980 < 0 /*Drops missing family income */
{txt}(781 observations deleted)

{com}.   drop if HGC_MOTHER_1979 < 0 /*Drops missing highest grade completed - mother 1979*/
{txt}(132 observations deleted)

{com}.   drop if HGC_FATHER_1979 < 0 /*Drops missing highest grade completed - father 1979*/
{txt}(166 observations deleted)

{com}.   
.   /*All merges merged using CASEID_1979 - Unique ID given to surveyed individuals*/
.   merge 1:1 CASEID_1979 using "C:\New Desktop\Economics\ECON 860\NLSY1979AGES\ages.dta" /*Merges Age information - What year/month born in */
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}           9,975
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}           9,975{txt}  (_merge==2)

{col 5}Matched{col 30}{res}           2,711{txt}  (_merge==3)
{col 5}{hline 41}

{com}.   drop _merge
{txt}
{com}.   merge 1:1 CASEID_1979 using "C:\New Desktop\Economics\ECON 860\NLSY1979FamStruct\FamStruct.dta" /*Merges family structure data*/
{res}{txt}(label {bf:{txt}vlR0173600} already defined)

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}          12,686{txt}  (_merge==3)
{col 5}{hline 41}

{com}.   drop _merge
{txt}
{com}.   merge 1:1 CASEID_1979 using "C:\New Desktop\Economics\ECON 860\NLSY1979_Employment\NLSY1979Employment.dta" /*Merges employment status over the 1979-1990 period*/
{res}{txt}(label {bf:{txt}vlR0173600} already defined)

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}          12,686{txt}  (_merge==3)
{col 5}{hline 41}

{com}.   drop _merge
{txt}
{com}.   drop if HGC_MOTHER_1979 ==. /*Drops all unmatched data points*/
{txt}(9,975 observations deleted)

{com}.   drop if Q1_3_A_Y_1979 < 58 /*Drops those born before 1958*/
{txt}(419 observations deleted)

{com}.   *drop if HGC_1979 < 0
.   *drop if REGION_1979 < 0
.   drop if URBAN_RURAL_1979<0 /*Drops missing urban or rural observations*/
{txt}(289 observations deleted)

{com}.   drop if FAM_28A_1979<0 /*Drops missing number of siblings*/
{txt}(1 observation deleted)

{com}.   drop if CRES_1_1988 ==-5 /*Drops missing information on biological nuclear family observations*/
{txt}(188 observations deleted)

{com}.   /*forvalues x=1979/1990{c -(}
>         drop if ESR_KEY_`x' < 0
>   {c )-}*/
.   gen south=cond( REGION_1979==3,1,0) /*Generates whether or not individual lived in a Southern state*/
{txt}
{com}.   gen bioNuclear=cond(CRES_1_1988==1,1,0) /*Generate biological nuclear family (lived with bio parents until 18)*/
{txt}
{com}.   gen mom=cond(BMOM14_1988==1|STPMOM14_1988==1|ADOPTM14_1988==1,1,0) /*Checks if lived with any category of mother at age 14*/
{txt}
{com}.   gen dad=cond(BDAD14_1988==1|STPDAD14_1988==1|ADOPTD14_1988==1,1,0)/*Checks if lived with any category of father at age 14*/
{txt}
{com}.   gen non_bioNuclear=cond((mom==1 & dad==1)|bioNuclear==1,1,0)/*Creates non-exclusive biological nuclear family - allows for Biological mother with Step father for example*/
{txt}
{com}.   drop if HGC_1979 ==0 | HGC_1979 ==4 |HGC_1979 ==5 /*Drops education less than 6, to stay consistent with B&H's min education*/
{txt}(9 observations deleted)

{com}.   
.    egen negFive=anycount(ESR*),values(-5) /*Gives count of -5's for an individual over ESR_KEY_1979 to ESR_KEY_1990 for each observation - ESR are categories of whether employeed or not*/
{res}{txt}
{com}.    drop if negFive >1 /*Drops if any individual exeriences more than 1 interupted survey*/
{txt}(94 observations deleted)

{com}.   
.   sum HGC_FATHER_1979 HGC_MOTHER_1979 URBAN_RURAL_1979 south bioNuclear FAM_28A_1979 non_bioNuclear HGC_1990

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
HGC_FAT~1979 {c |}{res}      1,711    12.04793      3.4754          0         20
{txt}HGC_MOT~1979 {c |}{res}      1,711    11.82233    2.517539          0         20
{txt}URBAN_R~1979 {c |}{res}      1,711    .7177089    .4502458          0          1
{txt}{space 7}south {c |}{res}      1,711    .2817066    .4499626          0          1
{txt}{space 2}bioNuclear {c |}{res}      1,711    .6902396    .4625299          0          1
{txt}{hline 13}{c +}{hline 57}
FAM_28A_1979 {c |}{res}      1,711    3.037405    2.041328          0         15
{txt}non_bioNuc~r {c |}{res}      1,711     .862069    .3449284          0          1
{txt}{space 4}HGC_1990 {c |}{res}      1,711    12.72823    3.863809         -5         20
{txt}
{com}.   log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\New Desktop\Economics\ECON 860\NLSY1979\NLSY1979_B_and_H_subset.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}22 Feb 2022, 15:27:27
{txt}{.-}
{smcl}
{txt}{sf}{ul off}